/*==============================================================================

   ゲーム処理 [game.cpp]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/

#include "game.h"
#include "main.h"
#include "input.h"
#include "keyboard.h"
#include "fade.h"
#include "player.h"
#include "collision.h"
#include "enemy.h"
#include "map.h"
#include "sound.h"
#include "timer.h"

/*------------------------------------------------------------------------------
   定数定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
   構造体宣言
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
   プロトタイプ宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
   グローバル変数の定義
------------------------------------------------------------------------------*/
unsigned char g_BGMNo2 = 0;


/*------------------------------------------------------------------------------
   初期化関数
------------------------------------------------------------------------------*/
void InitGame2(void)
{
	InitPlayer();
	InitEnemy2();
	InitMap2();
	//InitGasGauge();
	InitTimer();

	g_BGMNo2 = LoadSound("data/BGM/BGM.wav");
	PlaySound(g_BGMNo2, 255);
}

/*------------------------------------------------------------------------------
   終了処理をする関数
------------------------------------------------------------------------------*/
void UninitGame2(void)
{
	StopSoundAll();

	//初期化とは逆順に終了処理を行う
	UninitMap2();
	UninitPlayer();
	UninitEnemy2();
	//UninitGasGauge();
	UninitTimer();
}

/*------------------------------------------------------------------------------
   更新処理をする関数
------------------------------------------------------------------------------*/
void UpdateGame2(void)
{
	UpdateMap2();
	UpdateEnemy2();
	UpdatePlayer();
	//UpdateGasGauge();
	
	UpdateCollision();
	UpdateTimer();

	//スペースキーが押されていて、フェード処理中ではないとき
	if (Keyboard_IsKeyDown(KK_ENTER) ||
		IsButtonTriggered(0, XINPUT_GAMEPAD_B)
		&& GetFadeState() == FADE_NONE)
	{
		//RESULTへ移行する
		SceneTransition(SCENE_RESULT);
	}
}

/*------------------------------------------------------------------------------
   描画処理をする関数
------------------------------------------------------------------------------*/
void DrawGame2(void)
{
	DrawMap2();
	DrawPlayer();
	DrawEnemy2();
	//DrawGasGauge();
	DrawTimer();
}