/*==============================================================================

   巡回ルート管理 [patrol.cpp]
	Author :	古市
	Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#include "patrol.h"

// ルート座標値
const char g_Root[2][ROOT_MAX] =
{
	// 上がX 下がY
	{3 ,2 ,3 ,13,12,15,17,23,23,12,13,9 },
	{2 ,8 ,16,16, 2, 4, 1, 1,16,16, 4,2 }
};


char SetRouteX(char number)
{
	return g_Root[0][number];
}

char SetRouteY(char number)
{
	return g_Root[1][number];

}